БИТУправление_медицинским_центром_демо/src/DataProcessors/бит_БитфонАРМУправленияСобытиями/бит_БитфонАРМУправленияСобытиями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бит_БитфонАРМУправленияСобытиями</name>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/бит_СобытияБитФон/бит_СобытияБитФон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бит_СобытияБитФон</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.СобытияБитФон</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/DataProcessors/бит_БитфонАРМУправленияСобытиями/Forms/ДобавлениеСобытияНаПроизвольнуюДату/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Пользователь") И ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		Пользователь = Параметры.Пользователь;
		Элементы.Пользователь.ТолькоПросмотр= Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	Если СобытиеСуществует(Пользователь, Дата, Событие) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='На выбранную дату уже существует событие'"));
		Возврат;
	Иначе
		Закрыть(Новый Структура("Пользователь, Дата, Событие", Пользователь, Дата, Событие));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СобытиеСуществует(Пользователь, Дата, Событие)
	
	МЗ = РегистрыСведений.бит_СобытияБитФон.СоздатьМенеджерЗаписи();
	МЗ.Дата = Дата;
	МЗ.Пользователь = Пользователь;
	МЗ.Событие = Событие;
	МЗ.Прочитать();
	
	Возврат МЗ.Выбран();
	
КонецФункции

#КонецОбласти
